import maxios from "axios";
import mvue from "vue";
import mjquery from "jquery";

declare var axios: typeof maxios;
declare var Vue: typeof mvue;
declare var $: typeof mjquery;

var app;
$(document).ready(function () {
  app = new Vue({
    el: "#app",
    data: {
      logs: [],
      loc: "ph",
      lat: 37,
      lng: 126,
      hdg: 0,
      pitch: 45,
      yaw: 0,
      lockscroll: false,
      showDronePanel: false,
      showSchedulingPanel: false,
      showTopicTestPanel: true,
      rescheduling: `{
  "robots": [
    {
      "robotId": 1,
      "wayPoints": [
        { "posx": 10, "posy": 10 },
        { "posx": 10, "posy": 50 },
        { "posx": 60, "posy": 40 },
        { "posx": 60, "posy": 10 }
      ]
    }
  ]
}`,
      testtopic: "/mams/gw/cloud/ping" as string,
      topicdata: "{}" as string,
    },
    mounted: function () {},
    computed: {
      logMsg: function () {
        return this.logs.join("\n");
      },
    },
    methods: {
      log: function (msg) {
        var maxlines = 5000;
        if (this.logs.length > maxlines) {
          this.logs = this.logs.slice(maxlines / 2);
        }
        this.logs.push(msg);
        if (!this.lockscroll) {
          var textarea = document.getElementById("logmsg");
          setTimeout(function () {
            if (textarea) {
              textarea.scrollTop = textarea.scrollHeight;
            }
          }, 100);
        }
      },
      clickAddLog: function (e) {
        this.log("test");
      },
      clickClearLog: function (e) {
        this.logs = [];
      },
      clickMove: function () {
        var data = {
          topic: "/mams/" + this.loc + "/drone/cmder",
          body: {
            cmd: "MOVE",
            lat: Number(this.lat),
            lng: Number(this.lng),
          },
        };
        app.log("출동 : " + JSON.stringify(data));
        axios
          .post("/monitoring/api/mqtt/publishjson", data)
          .then((res) => {})
          .catch((e) => {
            app.log("출동 에러 : " + e);
          });
      },
      clickReturn: function () {
        var data = {
          topic: "/mams/" + this.loc + "/drone/cmder",
          body: {
            cmd: "RETURN",
          },
        };
        app.log("복귀 : " + JSON.stringify(data));
        axios
          .post("/monitoring/api/mqtt/publishjson", data)
          .then((res) => {})
          .catch((e) => {
            app.log("복귀 에러 : " + e);
          });
      },
      clickHeading: function () {
        var data = {
          topic: "/mams/" + this.loc + "/drone/cmder",
          body: {
            cmd: "HEADING",
            hdg: Number(this.hdg),
          },
        };
        app.log("헤딩 : " + JSON.stringify(data));
        axios
          .post("/monitoring/api/mqtt/publishjson", data)
          .then((res) => {})
          .catch((e) => {
            app.log("헤딩 에러 : " + e);
          });
      },
      clickGimbal: function () {
        var data = {
          topic: "/mams/" + this.loc + "/drone/cmder",
          body: {
            cmd: "GIMBAL",
            // pitch: '' + this.pitch,
            // yaw: '' + this.yaw
            pitch: Number(this.pitch),
            yaw: Number(this.yaw),
          },
        };
        app.log("GIMBAL : " + JSON.stringify(data));
        axios
          .post("/monitoring/api/mqtt/publishjson", data)
          .then((res) => {})
          .catch((e) => {
            app.log("GIMBAL 에러 : " + e);
          });
      },
      clickPause: function () {
        var data = {
          topic: "/mams/" + this.loc + "/drone/cmder",
          body: {
            cmd: "PAUSE",
          },
        };
        app.log("PAUSE : " + JSON.stringify(data));
        axios
          .post("/monitoring/api/mqtt/publishjson", data)
          .then((res) => {})
          .catch((e) => {
            app.log("PAUSE 에러 : " + e);
          });
      },
      clickRescheduling: function () {
        var data = {
          topic: "/mams/" + this.loc + "/scheduler/res",
          body: JSON.parse(this.rescheduling),
        };
        app.log("리스케쥴링 : " + JSON.stringify(data));
        axios
          .post("/monitoring/api/mqtt/publishjson", data)
          .then((res) => {})
          .catch((e) => {
            app.log("PAUSE 에러 : " + e);
          });
      },
      clickSendTopicData: function () {
        console.log("topic : ", app.testtopic);
        console.log("data : ", app.topicdata);
        try {
          var data = {
            topic: app.testtopic,
            body: JSON.parse(app.topicdata),
          };
          app.log("topic data : " + JSON.stringify(data));
          axios
            .post("/monitoring/api/mqtt/publishjson", data)
            .then((res) => {})
            .catch((e) => {
              app.log("topic test error : " + e);
            });
        } catch (e) {
          app.log("error : " + e.message);
          alert("에러 :" + e.message);
        }
      },
      sampleScheduleRes: function () {
        app.testtopic = "/mams/ph/scheduler/res";
        app.topicdata = `{"robots":[{"robotId":1,"wayPoints":[{"posx":421.5,"posy":868,"postheta":0},{"posx":242,"posy":873.5,"postheta":0},{"posx":147.5,"posy":729.5,"postheta":0},{"posx":162,"posy":550,"postheta":0},{"posx":332,"posy":521.5,"postheta":0},{"posx":562.5,"posy":520.5,"postheta":0},{"posx":653,"posy":693,"postheta":0},{"posx":609,"posy":881.5,"postheta":0},{"posx":687,"posy":1046.5,"postheta":0},{"posx":581,"posy":1184.5,"postheta":0},{"posx":420.5,"posy":1248.5,"postheta":0},{"posx":256,"posy":1340,"postheta":0},{"posx":188,"posy":1548,"postheta":0},{"posx":203,"posy":1720,"postheta":0},{"posx":188,"posy":1548,"postheta":0},{"posx":203,"posy":1720,"postheta":0},{"posx":256,"posy":1340,"postheta":0},{"posx":420.5,"posy":1248.5,"postheta":0},{"posx":790,"posy":1188.5,"postheta":0},{"posx":959,"posy":1225,"postheta":0},{"posx":1284.5,"posy":1224.5,"postheta":0},{"posx":1604.5,"posy":1217.5,"postheta":0},{"posx":1815,"posy":1214,"postheta":0},{"posx":2026.5,"posy":1229,"postheta":0}]},{"robotId":2,"wayPoints":[{"posx":1060.5,"posy":2547,"postheta":0},{"posx":1248.5,"posy":2541,"postheta":0},{"posx":1484.5,"posy":2535.5,"postheta":0},{"posx":1924,"posy":2500,"postheta":0},{"posx":1935.5,"posy":2227.5,"postheta":0},{"posx":1942,"posy":2019,"postheta":0},{"posx":1942,"posy":1847,"postheta":0},{"posx":2064,"posy":1705,"postheta":0},{"posx":1898,"posy":1645,"postheta":0},{"posx":2011,"posy":1513,"postheta":0},{"posx":2194,"posy":1471,"postheta":0},{"posx":2231,"posy":1649,"postheta":0},{"posx":2064,"posy":1705,"postheta":0},{"posx":1898,"posy":1645,"postheta":0},{"posx":2011,"posy":1513,"postheta":0},{"posx":2194,"posy":1471,"postheta":0},{"posx":2231,"posy":1649,"postheta":0},{"posx":1942,"posy":1847,"postheta":0},{"posx":2242.5,"posy":2023.5,"postheta":0},{"posx":2182,"posy":2191.5,"postheta":0},{"posx":2243.5,"posy":2353,"postheta":0},{"posx":2465,"posy":2362,"postheta":0},{"posx":2780,"posy":2358,"postheta":0},{"posx":2852,"posy":2200.5,"postheta":0},{"posx":2740.5,"posy":2016.5,"postheta":0},{"posx":2514,"posy":2014.5,"postheta":0}]},{"robotId":3,"wayPoints":[{"posx":523.5,"posy":2029.5,"postheta":0},{"posx":474,"posy":1864,"postheta":0},{"posx":646,"posy":1871.5,"postheta":0},{"posx":562,"posy":1716,"postheta":0},{"posx":834.5,"posy":1799.5,"postheta":0},{"posx":976.5,"posy":1686,"postheta":0},{"posx":1162.5,"posy":1681,"postheta":0},{"posx":1366.5,"posy":1677,"postheta":0},{"posx":1587.5,"posy":1671.5,"postheta":0},{"posx":1366.5,"posy":1677,"postheta":0},{"posx":1162.5,"posy":1681,"postheta":0},{"posx":976.5,"posy":1686,"postheta":0},{"posx":834.5,"posy":1799.5,"postheta":0},{"posx":826,"posy":2120.5,"postheta":0},{"posx":854.5,"posy":2318.5,"postheta":0},{"posx":836,"posy":2507,"postheta":0},{"posx":619,"posy":2513,"postheta":0},{"posx":446.5,"posy":2513,"postheta":0},{"posx":203,"posy":2447.5,"postheta":0},{"posx":219.5,"posy":2273.5,"postheta":0},{"posx":247,"posy":2103.5,"postheta":0},{"posx":199,"posy":1934,"postheta":0}]},{"robotId":4,"wayPoints":[{"posx":2467.5,"posy":1695.5,"postheta":0},{"posx":2679,"posy":1696.5,"postheta":0},{"posx":2876,"posy":1641,"postheta":0},{"posx":3059,"posy":1551.5,"postheta":0},{"posx":2952,"posy":1369,"postheta":0},{"posx":3105.5,"posy":1234.5,"postheta":0},{"posx":2934.5,"posy":1089.5,"postheta":0}]}]}
`;
      },
      sampleScheduleRes2: function () {
        app.testtopic = "/mams/ph/scheduler/res";
        app.topicdata = `{
  
  "robots": [
    {
      "robotId": 1,
      "wayPoints": [
        {
          "posx": -45.300000000000004,
          "posy": -39.375,
          "posTheta": 3.1082716577115459
        },
        {
          "posx": -54.300000000000004,
          "posy": -39.075,
          "posTheta": -0.019997333973150535
        },
        {
          "posx": -49.300000000000004,
          "posy": -39.175000000000004,
          "posTheta": -0.0099996666866652376
        },
        {
          "posx": -44.300000000000004,
          "posy": -39.225,
          "posTheta": 3.131592986903128
        },
        {
          "posx": -49.300000000000004,
          "posy": -39.175000000000004,
          "posTheta": 3.1215953196166426
        },
        {
          "posx": -54.300000000000004,
          "posy": -39.075,
          "posTheta": -2.1491218130753134
        },
        {
          "posx": -59.000000000000007,
          "posy": -46.275000000000006,
          "posTheta": -1.4931748180575031
        },
        {
          "posx": -58.300000000000004,
          "posy": -55.275000000000006,
          "posTheta": -0.16324028278483738
        },
        {
          "posx": -49.800000000000004,
          "posy": -56.675000000000004,
          "posTheta": -0.0043289772870595032
        },
        {
          "posx": -38.25,
          "posy": -56.725000000000009,
          "posTheta": 1.0887176253999915
        },
        {
          "posx": -33.750000000000007,
          "posy": -48.125000000000007,
          "posTheta": 1.799526420033726
        },
        {
          "posx": -35.95,
          "posy": -38.675000000000004,
          "posTheta": -1.3891474967948847
        },
        {
          "posx": -35.050000000000004,
          "posy": -43.575,
          "posTheta": 1.7524451567949086
        },
        {
          "posx": -35.95,
          "posy": -38.675000000000004,
          "posTheta": 1.1292039644876053
        },
        {
          "posx": -32.050000000000004,
          "posy": -30.425000000000004,
          "posTheta": 2.2257911823032117
        },
        {
          "posx": -37.350000000000009,
          "posy": -23.525000000000006,
          "posTheta": 2.7610862764774282
        },
        {
          "posx": -45.350000000000009,
          "posy": -20.325000000000003,
          "posTheta": 2.6375869228415234
        },
        {
          "posx": -53.600000000000009,
          "posy": -15.775000000000006,
          "posTheta": 2.0063900732663589
        },
        {
          "posx": -57.300000000000004,
          "posy": -7.8250000000000028,
          "posTheta": -1.1352025803234347
        },
        {
          "posx": -53.600000000000009,
          "posy": -15.775000000000006,
          "posTheta": 2.0063900732663589
        },
        {
          "posx": -57.300000000000004,
          "posy": -7.8250000000000028,
          "posTheta": -0.80788925778718768
        },
        {
          "posx": -45.350000000000009,
          "posy": -20.325000000000003,
          "posTheta": -0.16119091443824707
        },
        {
          "posx": -26.900000000000006,
          "posy": -23.325000000000003,
          "posTheta": 0.20988072266107496
        },
        {
          "posx": -18.450000000000003,
          "posy": -21.525000000000006,
          "posTheta": 0
        },
        {
          "posx": -2.1500000000000057,
          "posy": -21.525000000000006,
          "posTheta": -0.021871511825000696
        },
        {
          "posx": 13.849999999999994,
          "posy": -21.875,
          "posTheta": -0.019045315982016461
        },
        {
          "posx": 24.349999999999994,
          "posy": -22.075000000000003,
          "posTheta": 0.25475830243589487
        },
        {
          "posx": 29.150000000000006,
          "posy": -20.825000000000003,
          "posTheta": -2.8868343511538983
        },
        {
          "posx": 24.349999999999994,
          "posy": -22.075000000000003,
          "posTheta": 0
        },
        {
          "posx": 24.349999999999994,
          "posy": -22.075000000000003,
          "posTheta": 3.1225473376077768
        },
        {
          "posx": 13.825000000000003,
          "posy": -21.900000000000006,
          "posTheta": 3.1197211417647925
        },
        {
          "posx": -2.1749999999999972,
          "posy": -21.550000000000004,
          "posTheta": 3.1415926535897931
        },
        {
          "posx": -18.450000000000003,
          "posy": -21.525000000000006,
          "posTheta": -2.9317119309287181
        },
        {
          "posx": -26.900000000000006,
          "posy": -23.35,
          "posTheta": 2.9804017391515463
        },
        {
          "posx": -45.375,
          "posy": -20.35,
          "posTheta": 2.3337033958026057
        },
        {
          "posx": -57.325,
          "posy": -7.8500000000000085,
          "posTheta": -1.1352025803234347
        },
        {
          "posx": -53.600000000000009,
          "posy": -15.775000000000006,
          "posTheta": 2.0063900732663589
        },
        {
          "posx": -57.325,
          "posy": -7.8500000000000085,
          "posTheta": -1.1352025803234347
        },
        {
          "posx": -53.600000000000009,
          "posy": -15.775000000000006,
          "posTheta": -0.50400573074826982
        },
        {
          "posx": -45.375,
          "posy": -20.35,
          "posTheta": -0.3805063771123649
        },
        {
          "posx": -37.350000000000009,
          "posy": -23.550000000000004,
          "posTheta": -0.91580147128658163
        },
        {
          "posx": -32.050000000000004,
          "posy": -30.450000000000003,
          "posTheta": -2.0123886891021883
        },
        {
          "posx": -35.95,
          "posy": -38.7,
          "posTheta": -1.3420662335560674
        },
        {
          "posx": -33.750000000000007,
          "posy": -48.125000000000007,
          "posTheta": -2.0528750281898018
        },
        {
          "posx": -38.275000000000006,
          "posy": -56.75,
          "posTheta": 3.1372636763027337
        },
        {
          "posx": -49.800000000000004,
          "posy": -56.7,
          "posTheta": 2.9783523708049557
        },
        {
          "posx": -58.300000000000004,
          "posy": -55.275000000000006,
          "posTheta": 1.6484178355322903
        },
        {
          "posx": -59.025000000000006,
          "posy": -46.300000000000004,
          "posTheta": 0.99247084051447987
        },
        {
          "posx": -54.300000000000004,
          "posy": -39.1,
          "posTheta": -0.033320995878247196
        },
        {
          "posx": -45.325,
          "posy": -39.375,
          "posTheta": 0
        }
      ]
    },
    {
      "robotId": 2,
      "wayPoints": [
        {
          "posx": -25.1,
          "posy": 23.275000000000006,
          "posTheta": 1.4253657179928714
        },
        {
          "posx": -23.650000000000006,
          "posy": 33.175,
          "posTheta": 1.67151816478397
        },
        {
          "posx": -24.6,
          "posy": 42.575,
          "posTheta": 0.17593962545252784
        },
        {
          "posx": -13.350000000000001,
          "posy": 44.575,
          "posTheta": -0.031904064485022421
        },
        {
          "posx": -3.9500000000000028,
          "posy": 44.275000000000006,
          "posTheta": -0.021183271578959544
        },
        {
          "posx": 7.8499999999999943,
          "posy": 44.025000000000006,
          "posTheta": -0.081821473981976173
        },
        {
          "posx": 29.799999999999997,
          "posy": 42.224999999999994,
          "posTheta": -1.5267072693968249
        },
        {
          "posx": 30.400000000000006,
          "posy": 28.625,
          "posTheta": -1.5420960755954236
        },
        {
          "posx": 30.700000000000003,
          "posy": 18.174999999999997,
          "posTheta": -1.5707963267948966
        },
        {
          "posx": 30.700000000000003,
          "posy": 9.5750000000000028,
          "posTheta": -0.86101130663427816
        },
        {
          "posx": 36.8,
          "posy": 2.4749999999999943,
          "posTheta": -2.7947577560087855
        },
        {
          "posx": 28.5,
          "posy": -0.52500000000000568,
          "posTheta": -0.86279427431149391
        },
        {
          "posx": 34.150000000000006,
          "posy": -7.125,
          "posTheta": -0.225601243836024
        },
        {
          "posx": 43.3,
          "posy": -9.2250000000000085,
          "posTheta": 1.3658496699061746
        },
        {
          "posx": 45.150000000000006,
          "posy": -0.32500000000000284,
          "posTheta": 0.19577218465255797
        },
        {
          "posx": 57,
          "posy": 2.0250000000000057,
          "posTheta": 0.0047393010094665226
        },
        {
          "posx": 67.550000000000011,
          "posy": 2.0750000000000028,
          "posTheta": -3.1368533525803266
        },
        {
          "posx": 57,
          "posy": 2.0250000000000057,
          "posTheta": 0.0047393010094665226
        },
        {
          "posx": 67.550000000000011,
          "posy": 2.0750000000000028,
          "posTheta": -3.0348569809406576
        },
        {
          "posx": 45.150000000000006,
          "posy": -0.32500000000000284,
          "posTheta": 2.8180467689856172
        },
        {
          "posx": 36.8,
          "posy": 2.4749999999999943,
          "posTheta": -2.7947577560087855
        },
        {
          "posx": 28.5,
          "posy": -0.52500000000000568,
          "posTheta": -0.86279427431149391
        },
        {
          "posx": 34.150000000000006,
          "posy": -7.125,
          "posTheta": -0.225601243836024
        },
        {
          "posx": 43.3,
          "posy": -9.2250000000000085,
          "posTheta": 2.16124990582671
        },
        {
          "posx": 30.700000000000003,
          "posy": 9.5750000000000028,
          "posTheta": 0.53157886615629768
        },
        {
          "posx": 45.75,
          "posy": 18.424999999999997,
          "posTheta": 1.9190893189429361
        },
        {
          "posx": 42.7,
          "posy": 26.825000000000003,
          "posTheta": -1.9151967288376939
        },
        {
          "posx": 41.05,
          "posy": 22.224999999999994,
          "posTheta": -2.5424173306034863
        },
        {
          "posx": 36.95,
          "posy": 19.424999999999997,
          "posTheta": -2.2344967081692491
        },
        {
          "posx": 33.900000000000006,
          "posy": 15.525000000000006,
          "posTheta": 0.90709594542054428
        },
        {
          "posx": 36.95,
          "posy": 19.424999999999997,
          "posTheta": 0.59917532298630682
        },
        {
          "posx": 41.05,
          "posy": 22.224999999999994,
          "posTheta": 1.2263959247520995
        },
        {
          "posx": 42.7,
          "posy": 26.825000000000003,
          "posTheta": 1.2032063465171376
        },
        {
          "posx": 45.8,
          "posy": 34.875,
          "posTheta": 0.040701491478802351
        },
        {
          "posx": 56.849999999999994,
          "posy": 35.325,
          "posTheta": -3.1016139664665032
        },
        {
          "posx": 51.849999999999994,
          "posy": 35.125,
          "posTheta": 0.039978687123290044
        },
        {
          "posx": 56.849999999999994,
          "posy": 35.325,
          "posTheta": -0.012697730226091093
        },
        {
          "posx": 72.6,
          "posy": 35.125,
          "posTheta": -1.1408147494561094
        },
        {
          "posx": 76.199999999999989,
          "posy": 27.275000000000006,
          "posTheta": -2.1136100762814172
        },
        {
          "posx": 70.65,
          "posy": 18.075000000000003,
          "posTheta": -3.1327823088690172
        },
        {
          "posx": 59.3,
          "posy": 17.974999999999994,
          "posTheta": 0.019997333973150535
        },
        {
          "posx": 64.300000000000011,
          "posy": 18.075000000000003,
          "posTheta": 0.049958395721942765
        },
        {
          "posx": 69.300000000000011,
          "posy": 18.325000000000003,
          "posTheta": 0.34788839127999538
        },
        {
          "posx": 73.85,
          "posy": 19.974999999999994,
          "posTheta": -2.7937042623097978
        },
        {
          "posx": 69.300000000000011,
          "posy": 18.325000000000003,
          "posTheta": -3.0916342578678506
        },
        {
          "posx": 64.300000000000011,
          "posy": 18.075000000000003,
          "posTheta": 0
        },
        {
          "posx": 70.625,
          "posy": 18.049999999999997,
          "posTheta": 1.0279825773083759
        },
        {
          "posx": 76.199999999999989,
          "posy": 27.25,
          "posTheta": 2.0007779041336837
        },
        {
          "posx": 72.6,
          "posy": 35.125,
          "posTheta": 3.1288949233637022
        },
        {
          "posx": 56.849999999999994,
          "posy": 35.325,
          "posTheta": -3.1008911621109907
        },
        {
          "posx": 45.775000000000006,
          "posy": 34.875,
          "posTheta": -1.9383863070726557
        },
        {
          "posx": 42.7,
          "posy": 26.799999999999997,
          "posTheta": -1.2225033346468572
        },
        {
          "posx": 45.724999999999994,
          "posy": 18.400000000000006,
          "posTheta": -2.6100137874334957
        },
        {
          "posx": 30.700000000000003,
          "posy": 9.5750000000000028,
          "posTheta": -0.98034274776308339
        },
        {
          "posx": 43.3,
          "posy": -9.2250000000000085,
          "posTheta": 2.9159914097537691
        },
        {
          "posx": 34.150000000000006,
          "posy": -7.125,
          "posTheta": 2.2787983792782995
        },
        {
          "posx": 28.5,
          "posy": -0.52500000000000568,
          "posTheta": 0.34683489758100761
        },
        {
          "posx": 36.8,
          "posy": 2.4749999999999943,
          "posTheta": -0.32354588460417583
        },
        {
          "posx": 45.150000000000006,
          "posy": -0.32500000000000284,
          "posTheta": 0.10673567264913564
        },
        {
          "posx": 67.550000000000011,
          "posy": 2.0499999999999972,
          "posTheta": -3.1368533525803266
        },
        {
          "posx": 56.974999999999994,
          "posy": 2,
          "posTheta": 0.0047393010094665226
        },
        {
          "posx": 67.550000000000011,
          "posy": 2.0499999999999972,
          "posTheta": -3.1368533525803266
        },
        {
          "posx": 56.974999999999994,
          "posy": 2,
          "posTheta": -2.9458204689372351
        },
        {
          "posx": 45.150000000000006,
          "posy": -0.32500000000000284,
          "posTheta": -1.7757429836836187
        },
        {
          "posx": 43.3,
          "posy": -9.2250000000000085,
          "posTheta": 2.9159914097537691
        },
        {
          "posx": 34.150000000000006,
          "posy": -7.125,
          "posTheta": 2.2787983792782995
        },
        {
          "posx": 28.5,
          "posy": -0.52500000000000568,
          "posTheta": 0.34683489758100761
        },
        {
          "posx": 36.8,
          "posy": 2.4749999999999943,
          "posTheta": 2.2805813469555152
        },
        {
          "posx": 30.700000000000003,
          "posy": 9.5750000000000028,
          "posTheta": 1.5707963267948966
        },
        {
          "posx": 30.700000000000003,
          "posy": 18.174999999999997,
          "posTheta": 1.5994965779943697
        },
        {
          "posx": 30.375,
          "posy": 28.599999999999994,
          "posTheta": 1.6148853841929685
        },
        {
          "posx": 29.799999999999997,
          "posy": 42.224999999999994,
          "posTheta": 3.0597711796078171
        },
        {
          "posx": 7.8250000000000028,
          "posy": 44,
          "posTheta": 3.1204093820108336
        },
        {
          "posx": -3.9750000000000014,
          "posy": 44.275000000000006,
          "posTheta": 3.109688589104771
        },
        {
          "posx": -13.375,
          "posy": 44.575,
          "posTheta": -2.9656530281372655
        },
        {
          "posx": -24.6,
          "posy": 42.575,
          "posTheta": -1.4700744888058233
        },
        {
          "posx": -23.675000000000004,
          "posy": 33.150000000000006,
          "posTheta": -1.716226935596922
        },
        {
          "posx": -25.1,
          "posy": 23.25,
          "posTheta": 0
        }
      ]
    },
    {
      "robotId": 3,
      "wayPoints": [
        {
          "posx": 77.4,
          "posy": -0.72499999999999432,
          "posTheta": 0.62141634659676
        },
        {
          "posx": 81.449999999999989,
          "posy": 2.1749999999999972,
          "posTheta": -2.520176306993033
        },
        {
          "posx": 77.4,
          "posy": -0.72499999999999432,
          "posTheta": -1.1383885512243588
        },
        {
          "posx": 79.5,
          "posy": -5.2750000000000057,
          "posTheta": 2.0032041023654346
        },
        {
          "posx": 77.4,
          "posy": -0.72499999999999432,
          "posTheta": -0.45265904031807247
        },
        {
          "posx": 86.550000000000011,
          "posy": -5.1749999999999972,
          "posTheta": -2.0998894505904584
        },
        {
          "posx": 81.199999999999989,
          "posy": -14.325000000000003,
          "posTheta": -0.71606502970923969
        },
        {
          "posx": 88.9,
          "posy": -21.025000000000006,
          "posTheta": -2.4382880535274807
        },
        {
          "posx": 80.35,
          "posy": -28.275000000000006,
          "posTheta": -0.97162100380858973
        },
        {
          "posx": 83.15,
          "posy": -32.375,
          "posTheta": 1.1018763589150389
        },
        {
          "posx": 88.875,
          "posy": -21.050000000000004,
          "posTheta": 2.4255276238805537
        },
        {
          "posx": 81.199999999999989,
          "posy": -14.325000000000003,
          "posTheta": 1.0417032029993347
        },
        {
          "posx": 86.550000000000011,
          "posy": -5.2000000000000028,
          "posTheta": 2.688933613271721
        },
        {
          "posx": 77.4,
          "posy": -0.72499999999999432,
          "posTheta": 0
        },
        {
          "posx": 45.150000000000006,
          "posy": -0.32500000000000284,
          "posTheta": 0.19577218465255797
        },
        {
          "posx": 57,
          "posy": 2.0250000000000057,
          "posTheta": 0.0047393010094665226
        },
        {
          "posx": 67.550000000000011,
          "posy": 2.0750000000000028,
          "posTheta": -3.1368533525803266
        },
        {
          "posx": 57,
          "posy": 2.0250000000000057,
          "posTheta": 0.0047393010094665226
        },
        {
          "posx": 67.550000000000011,
          "posy": 2.0750000000000028,
          "posTheta": -3.0348569809406576
        },
        {
          "posx": 45.150000000000006,
          "posy": -0.32500000000000284,
          "posTheta": 2.8180467689856172
        },
        {
          "posx": 36.8,
          "posy": 2.4749999999999943,
          "posTheta": -2.7947577560087855
        },
        {
          "posx": 28.5,
          "posy": -0.52500000000000568,
          "posTheta": -0.86279427431149391
        },
        {
          "posx": 34.150000000000006,
          "posy": -7.125,
          "posTheta": -0.225601243836024
        },
        {
          "posx": 43.3,
          "posy": -9.2250000000000085,
          "posTheta": 2.16124990582671
        },
        {
          "posx": 30.700000000000003,
          "posy": 9.5750000000000028,
          "posTheta": 0.53157886615629768
        },
        {
          "posx": 45.75,
          "posy": 18.424999999999997,
          "posTheta": 1.9190893189429361
        },
        {
          "posx": 42.7,
          "posy": 26.825000000000003,
          "posTheta": -1.9151967288376939
        },
        {
          "posx": 41.05,
          "posy": 22.224999999999994,
          "posTheta": -2.5424173306034863
        },
        {
          "posx": 36.95,
          "posy": 19.424999999999997,
          "posTheta": -2.2344967081692491
        },
        {
          "posx": 33.900000000000006,
          "posy": 15.525000000000006,
          "posTheta": 0.90709594542054428
        },
        {
          "posx": 36.95,
          "posy": 19.424999999999997,
          "posTheta": 0.59917532298630682
        },
        {
          "posx": 41.05,
          "posy": 22.224999999999994,
          "posTheta": 1.2263959247520995
        },
        {
          "posx": 42.7,
          "posy": 26.825000000000003,
          "posTheta": 1.2032063465171376
        },
        {
          "posx": 45.8,
          "posy": 34.875,
          "posTheta": 0.040701491478802351
        },
        {
          "posx": 56.849999999999994,
          "posy": 35.325,
          "posTheta": -3.1016139664665032
        },
        {
          "posx": 51.849999999999994,
          "posy": 35.125,
          "posTheta": 0.039978687123290044
        },
        {
          "posx": 56.849999999999994,
          "posy": 35.325,
          "posTheta": -0.012697730226091093
        },
        {
          "posx": 72.6,
          "posy": 35.125,
          "posTheta": -1.1408147494561094
        },
        {
          "posx": 76.199999999999989,
          "posy": 27.275000000000006,
          "posTheta": -2.1136100762814172
        },
        {
          "posx": 70.65,
          "posy": 18.075000000000003,
          "posTheta": -3.1327823088690172
        },
        {
          "posx": 59.3,
          "posy": 17.974999999999994,
          "posTheta": 0.019997333973150535
        },
        {
          "posx": 64.300000000000011,
          "posy": 18.075000000000003,
          "posTheta": 0.049958395721942765
        },
        {
          "posx": 69.300000000000011,
          "posy": 18.325000000000003,
          "posTheta": 0.34788839127999538
        },
        {
          "posx": 73.85,
          "posy": 19.974999999999994,
          "posTheta": -2.7937042623097978
        },
        {
          "posx": 69.300000000000011,
          "posy": 18.325000000000003,
          "posTheta": -3.0916342578678506
        },
        {
          "posx": 64.300000000000011,
          "posy": 18.075000000000003,
          "posTheta": 0
        },
        {
          "posx": 70.625,
          "posy": 18.049999999999997,
          "posTheta": 1.0279825773083759
        },
        {
          "posx": 76.199999999999989,
          "posy": 27.25,
          "posTheta": 2.0007779041336837
        },
        {
          "posx": 72.6,
          "posy": 35.125,
          "posTheta": 3.1288949233637022
        },
        {
          "posx": 56.849999999999994,
          "posy": 35.325,
          "posTheta": -3.1008911621109907
        },
        {
          "posx": 45.775000000000006,
          "posy": 34.875,
          "posTheta": -1.9383863070726557
        },
        {
          "posx": 42.7,
          "posy": 26.799999999999997,
          "posTheta": -1.2225033346468572
        },
        {
          "posx": 45.724999999999994,
          "posy": 18.400000000000006,
          "posTheta": -2.6100137874334957
        },
        {
          "posx": 30.700000000000003,
          "posy": 9.5750000000000028,
          "posTheta": -0.98034274776308339
        },
        {
          "posx": 43.3,
          "posy": -9.2250000000000085,
          "posTheta": 2.9159914097537691
        },
        {
          "posx": 34.150000000000006,
          "posy": -7.125,
          "posTheta": 2.2787983792782995
        },
        {
          "posx": 28.5,
          "posy": -0.52500000000000568,
          "posTheta": 0.34683489758100761
        },
        {
          "posx": 36.8,
          "posy": 2.4749999999999943,
          "posTheta": -0.32354588460417583
        },
        {
          "posx": 45.150000000000006,
          "posy": -0.32500000000000284,
          "posTheta": 0.10673567264913564
        },
        {
          "posx": 67.550000000000011,
          "posy": 2.0499999999999972,
          "posTheta": -3.1368533525803266
        },
        {
          "posx": 56.974999999999994,
          "posy": 2,
          "posTheta": 0.0047393010094665226
        },
        {
          "posx": 67.550000000000011,
          "posy": 2.0499999999999972,
          "posTheta": -3.1368533525803266
        },
        {
          "posx": 56.974999999999994,
          "posy": 2,
          "posTheta": -2.9458204689372351
        },
        {
          "posx": 45.150000000000006,
          "posy": -0.32500000000000284,
          "posTheta": -1.7757429836836187
        },
        {
          "posx": 43.3,
          "posy": -9.2250000000000085,
          "posTheta": 2.9159914097537691
        },
        {
          "posx": 34.150000000000006,
          "posy": -7.125,
          "posTheta": 2.2787983792782995
        },
        {
          "posx": 28.5,
          "posy": -0.52500000000000568,
          "posTheta": 0.34683489758100761
        },
        {
          "posx": 36.8,
          "posy": 2.4749999999999943,
          "posTheta": 2.2805813469555152
        },
        {
          "posx": 30.700000000000003,
          "posy": 9.5750000000000028,
          "posTheta": 1.5707963267948966
        },
        {
          "posx": 30.700000000000003,
          "posy": 18.174999999999997,
          "posTheta": 1.5994965779943697
        },
        {
          "posx": 30.375,
          "posy": 28.599999999999994,
          "posTheta": 1.6148853841929685
        },
        {
          "posx": 29.799999999999997,
          "posy": 42.224999999999994,
          "posTheta": 3.0597711796078171
        },
        {
          "posx": 7.8250000000000028,
          "posy": 44,
          "posTheta": 3.1204093820108336
        },
        {
          "posx": -3.9750000000000014,
          "posy": 44.275000000000006,
          "posTheta": 3.109688589104771
        },
        {
          "posx": -13.375,
          "posy": 44.575,
          "posTheta": -2.9656530281372655
        },
        {
          "posx": -24.6,
          "posy": 42.575,
          "posTheta": -1.4700744888058233
        },
        {
          "posx": -23.675000000000004,
          "posy": 33.150000000000006,
          "posTheta": -1.716226935596922
        },
        {
          "posx": -25.1,
          "posy": 23.25,
          "posTheta": 0
        }
      ]
    },
    {
      "robotId": 4,
      "wayPoints": [
        {
          "posx": 13,
          "posy": 0.82500000000000284,
          "posTheta": 3.1189720782344796
        },
        {
          "posx": 1.9500000000000028,
          "posy": 1.0750000000000028,
          "posTheta": -0.0299910048568779
        },
        {
          "posx": 6.9500000000000028,
          "posy": 0.92499999999999716,
          "posTheta": 3.1116016487329152
        },
        {
          "posx": 1.9500000000000028,
          "posy": 1.0750000000000028,
          "posTheta": 3.1219873227325885
        },
        {
          "posx": -8.25,
          "posy": 1.2750000000000057,
          "posTheta": 3.1147174055050364
        },
        {
          "posx": -17.550000000000004,
          "posy": 1.5250000000000057,
          "posTheta": 2.4651364471822106
        },
        {
          "posx": -24.650000000000006,
          "posy": 7.2249999999999943,
          "posTheta": 2.9224219516114456
        },
        {
          "posx": -35.2,
          "posy": 9.5750000000000028,
          "posTheta": -1.0500679353878259
        },
        {
          "posx": -33.250000000000007,
          "posy": 6.1749999999999972,
          "posTheta": 2.0915247182019674
        },
        {
          "posx": -35.2,
          "posy": 9.5750000000000028,
          "posTheta": 2.2364383390547955
        },
        {
          "posx": -40.5,
          "posy": 16.325000000000003,
          "posTheta": -0.019997333973150535
        },
        {
          "posx": -35.5,
          "posy": 16.224999999999994,
          "posTheta": 0.13188308319837283
        },
        {
          "posx": -30.6,
          "posy": 16.875,
          "posTheta": 0.65381002193952775
        },
        {
          "posx": -26.75,
          "posy": 19.825000000000003,
          "posTheta": 1.277429314965187
        },
        {
          "posx": -25.300000000000004,
          "posy": 24.625,
          "posTheta": -1.8641633386246064
        },
        {
          "posx": -26.75,
          "posy": 19.825000000000003,
          "posTheta": -2.4877826316502656
        },
        {
          "posx": -30.6,
          "posy": 16.875,
          "posTheta": -3.0097095703914203
        },
        {
          "posx": -35.5,
          "posy": 16.224999999999994,
          "posTheta": 3.1215953196166426
        },
        {
          "posx": -40.5,
          "posy": 16.325000000000003,
          "posTheta": -2.4779769068053961
        },
        {
          "posx": -49.900000000000006,
          "posy": 8.9749999999999943,
          "posTheta": -0.13459791416046671
        },
        {
          "posx": -45.100000000000009,
          "posy": 8.3250000000000028,
          "posTheta": 3.0069947394293264
        },
        {
          "posx": -49.900000000000006,
          "posy": 8.9749999999999943,
          "posTheta": -2.3677769838010012
        },
        {
          "posx": -56.45,
          "posy": 2.5750000000000028,
          "posTheta": 0
        },
        {
          "posx": -56.45,
          "posy": 2.5499999999999972,
          "posTheta": 0.773815669788792
        },
        {
          "posx": -49.925000000000004,
          "posy": 8.9749999999999943,
          "posTheta": 0.66361574678439739
        },
        {
          "posx": -40.525000000000006,
          "posy": 16.325000000000003,
          "posTheta": -0.90515431453499751
        },
        {
          "posx": -35.225000000000009,
          "posy": 9.5499999999999972,
          "posTheta": -0.21917070197834751
        },
        {
          "posx": -24.675000000000004,
          "posy": 7.2000000000000028,
          "posTheta": -0.67645620640758253
        },
        {
          "posx": -17.575000000000003,
          "posy": 1.5250000000000057,
          "posTheta": -0.026875248084756845
        },
        {
          "posx": -8.2750000000000057,
          "posy": 1.2750000000000057,
          "posTheta": -0.019605330857204686
        },
        {
          "posx": 1.9249999999999972,
          "posy": 1.0750000000000028,
          "posTheta": -0.022620575355313758
        },
        {
          "posx": 12.974999999999994,
          "posy": 0.79999999999999716,
          "posTheta": 0
        },
        {
          "posx": 42.7,
          "posy": 26.825000000000003,
          "posTheta": 1.2032063465171376
        },
        {
          "posx": 45.8,
          "posy": 34.875,
          "posTheta": 0.040701491478802351
        },
        {
          "posx": 56.849999999999994,
          "posy": 35.325,
          "posTheta": -3.1016139664665032
        },
        {
          "posx": 51.849999999999994,
          "posy": 35.125,
          "posTheta": 0.039978687123290044
        },
        {
          "posx": 56.849999999999994,
          "posy": 35.325,
          "posTheta": -0.012697730226091093
        },
        {
          "posx": 72.6,
          "posy": 35.125,
          "posTheta": -1.1408147494561094
        },
        {
          "posx": 76.199999999999989,
          "posy": 27.275000000000006,
          "posTheta": -2.1136100762814172
        },
        {
          "posx": 70.65,
          "posy": 18.075000000000003,
          "posTheta": -3.1327823088690172
        },
        {
          "posx": 59.3,
          "posy": 17.974999999999994,
          "posTheta": 0.019997333973150535
        },
        {
          "posx": 64.300000000000011,
          "posy": 18.075000000000003,
          "posTheta": 0.049958395721942765
        },
        {
          "posx": 69.300000000000011,
          "posy": 18.325000000000003,
          "posTheta": 0.34788839127999538
        },
        {
          "posx": 73.85,
          "posy": 19.974999999999994,
          "posTheta": -2.7937042623097978
        },
        {
          "posx": 69.300000000000011,
          "posy": 18.325000000000003,
          "posTheta": -3.0916342578678506
        },
        {
          "posx": 64.300000000000011,
          "posy": 18.075000000000003,
          "posTheta": 0
        },
        {
          "posx": 70.625,
          "posy": 18.049999999999997,
          "posTheta": 1.0279825773083759
        },
        {
          "posx": 76.199999999999989,
          "posy": 27.25,
          "posTheta": 2.0007779041336837
        },
        {
          "posx": 72.6,
          "posy": 35.125,
          "posTheta": 3.1288949233637022
        },
        {
          "posx": 56.849999999999994,
          "posy": 35.325,
          "posTheta": -3.1008911621109907
        },
        {
          "posx": 45.775000000000006,
          "posy": 34.875,
          "posTheta": -1.9383863070726557
        },
        {
          "posx": 42.7,
          "posy": 26.799999999999997,
          "posTheta": -1.2225033346468572
        },
        {
          "posx": 45.724999999999994,
          "posy": 18.400000000000006,
          "posTheta": -2.6100137874334957
        },
        {
          "posx": 30.700000000000003,
          "posy": 9.5750000000000028,
          "posTheta": -0.98034274776308339
        },
        {
          "posx": 43.3,
          "posy": -9.2250000000000085,
          "posTheta": 2.9159914097537691
        },
        {
          "posx": 34.150000000000006,
          "posy": -7.125,
          "posTheta": 2.2787983792782995
        },
        {
          "posx": 28.5,
          "posy": -0.52500000000000568,
          "posTheta": 0.34683489758100761
        },
        {
          "posx": 36.8,
          "posy": 2.4749999999999943,
          "posTheta": -0.32354588460417583
        },
        {
          "posx": 45.150000000000006,
          "posy": -0.32500000000000284,
          "posTheta": 0.10673567264913564
        },
        {
          "posx": 67.550000000000011,
          "posy": 2.0499999999999972,
          "posTheta": -3.1368533525803266
        },
        {
          "posx": 56.974999999999994,
          "posy": 2,
          "posTheta": 0.0047393010094665226
        },
        {
          "posx": 67.550000000000011,
          "posy": 2.0499999999999972,
          "posTheta": -3.1368533525803266
        },
        {
          "posx": 56.974999999999994,
          "posy": 2,
          "posTheta": -2.9458204689372351
        },
        {
          "posx": 45.150000000000006,
          "posy": -0.32500000000000284,
          "posTheta": -1.7757429836836187
        },
        {
          "posx": 43.3,
          "posy": -9.2250000000000085,
          "posTheta": 2.9159914097537691
        },
        {
          "posx": 34.150000000000006,
          "posy": -7.125,
          "posTheta": 2.2787983792782995
        },
        {
          "posx": 28.5,
          "posy": -0.52500000000000568,
          "posTheta": 0.34683489758100761
        },
        {
          "posx": 36.8,
          "posy": 2.4749999999999943,
          "posTheta": 2.2805813469555152
        },
        {
          "posx": 30.700000000000003,
          "posy": 9.5750000000000028,
          "posTheta": 1.5707963267948966
        },
        {
          "posx": 30.700000000000003,
          "posy": 18.174999999999997,
          "posTheta": 1.5994965779943697
        },
        {
          "posx": 30.375,
          "posy": 28.599999999999994,
          "posTheta": 1.6148853841929685
        },
        {
          "posx": 29.799999999999997,
          "posy": 42.224999999999994,
          "posTheta": 3.0597711796078171
        },
        {
          "posx": 7.8250000000000028,
          "posy": 44,
          "posTheta": 3.1204093820108336
        },
        {
          "posx": -3.9750000000000014,
          "posy": 44.275000000000006,
          "posTheta": 3.109688589104771
        },
        {
          "posx": -13.375,
          "posy": 44.575,
          "posTheta": -2.9656530281372655
        },
        {
          "posx": -24.6,
          "posy": 42.575,
          "posTheta": -1.4700744888058233
        },
        {
          "posx": -23.675000000000004,
          "posy": 33.150000000000006,
          "posTheta": -1.716226935596922
        },
        {
          "posx": -25.1,
          "posy": 23.25,
          "posTheta": 0
        }
      ]
    }
  ]
}
`;
      },
      sampleEvent: function () {
        app.testtopic = "/mams/ph/etri/event";
        app.topicdata = `{
  "eventid": 1111,
  "status": 1,
  "agentid": 2,
  "abnormalType": 1,
  "abnormalDetail": 1,
  "posx": 10,
  "posy": 10,
  "fbNeed": "Y"
}
`;
      },
      sampleRobotStat: function () {
        app.testtopic = "/mams/ph/cloud/status";
        app.topicdata = `{
  "robotId": 1,
  "timestamp": "20200821-010203.004",
  "areaCode": "P",
  "lat": 36.11911705,
  "lon": 129.4161668,
  "posx": 0,
  "posy": 0,
  "curTargetx": 0,
  "curTargety": 0,
  "curTargetTheta": 0,
  "prevTargetx": 0,
  "prevTargety": 0,
  "prevTargetTheta": 0,
  "battery": 55
}`;
      },
      sampleScheduleAbnormal: function () {
        app.testtopic = "/mams/ph/scheduler/req";
        app.topicdata = `{
    "reqType":"ABNORMAL",
    "agentId":1,
    "posx":10,
    "posy":10, 
    "robots":[
        {
            "robotId":1,
            "posx":10,
            "posy":10,
            "curTargetx": 10,
            "curTargety": 10,
            "curTargetTheta":10,
            "prevTargetx":10,
            "prevTargety":10,
            "prevTargetTheta":10
        },
        {
            "robotId":2,
            "posx":10,
            "posy":10,
            "curTargetx": 10,
            "curTargety": 10,
            "curTargetTheta":10,
            "prevTargetx":10,
            "prevTargety":10,
            "prevTargetTheta":10
        },
        {
            "robotId":3,
            "posx":10,
            "posy":10,
            "curTargetx": 10,
            "curTargety": 10,
            "curTargetTheta":10,
            "prevTargetx":10,
            "prevTargety":10,
            "prevTargetTheta":10
        }
    ]
}`;
      },
      sampleScheduleLowBat: function () {
        app.testtopic = "/mams/ph/scheduler/req";
        app.topicdata = `{
  "reqType": "LOWBAT",
  "agentId": 1,
  "posx": 0,
  "posy": 0,
  "robots": [
    {
      "robotId": 1,
      "posx": 10,
      "posy": 10,
      "curTargetx": 10,
      "curTargety": 10,
      "curTargetTheta": 10,
      "prevTargetx": 10,
      "prevTargety": 10,
      "prevTargetTheta": 10
    },
    {
      "robotId": 2,
      "posx": 10,
      "posy": 10,
      "curTargetx": 10,
      "curTargety": 10,
      "curTargetTheta": 10,
      "prevTargetx": 10,
      "prevTargety": 10,
      "prevTargetTheta": 10
    },
    {
      "robotId": 3,
      "posx": 10,
      "posy": 10,
      "curTargetx": 10,
      "curTargety": 10,
      "curTargetTheta": 10,
      "prevTargetx": 10,
      "prevTargety": 10,
      "prevTargetTheta": 10
    }
  ]
}`;
      },
      sampleScheduleInit: function () {
        app.testtopic = "/mams/ph/scheduler/req";
        app.topicdata = `{
    "reqType":"INIT",
    "agentId":0,
    "posx":0,
    "posy":0, 
    "robots":[
        {
            "robotId":1,
            "posx":0,
            "posy":0,
            "curTargetx": 0,
            "curTargety": 0,
            "curTargetTheta":0,
            "prevTargetx":0,
            "prevTargety":0,
            "prevTargetTheta":0
        },
        {
            "robotId":2,
            "posx":0,
            "posy":0,
            "curTargetx": 0,
            "curTargety": 0,
            "curTargetTheta":0,
            "prevTargetx":0,
            "prevTargety":0,
            "prevTargetTheta":0
        },
        {
            "robotId":3,
            "posx":0,
            "posy":0,
            "curTargetx": 0,
            "curTargety": 0,
            "curTargetTheta":0,
            "prevTargetx":0,
            "prevTargety":0,
            "prevTargetTheta":0
        }
    ]
}
        `;
      },
    },
  });

  var wsmqttfn = function () {
    var wrap = {
      sendMessage: null as Function,
      isClosed: null as Function,
      stat: null as Function,
    };
    var wspath = "ws://" + location.host + "/monitoring/mqtt";
    var ws = new WebSocket(wspath);
    console.log("[WS] location.host : " + location.host);
    app.log("[WS] location.host : " + location.host);

    wrap.sendMessage = function (msg) {
      var jsonMsg = JSON.stringify(msg);
      console.log("[WS] Senging message(from brws): " + jsonMsg + ", state : " + ws.readyState);
      app.log("[WS] Senging message(from brws): " + jsonMsg + ", state : " + ws.readyState);

      if (ws.readyState != 1) {
        //OPEN=1, CLOSING=2, CLOSED:2
        console.error("[WS] reconstructed websocket!");
        app.log("[WS] reconstructed websocket!");
        return;
      }

      ws.send(jsonMsg);
    };
    wrap.isClosed = () => {
      if (ws.readyState == WebSocket.CLOSED) return true;
      return false;
    };
    wrap.stat = function () {
      console.log("ws ", ws.readyState, ws);
    };

    ws.onopen = function (e) {
      console.info("[WS] websocket connected", e);
      app.log("[WS] websocket connected");
    };

    ws.onclose = function (e) {
      console.info("[WS] session closed", e);
      app.log("[WS] session closed");
    };

    ws.onmessage = function (e) {
      console.info("Message Recv :", e);
      console.info("Message Recv Data :", e.data);

      try {
        var msg = JSON.parse(e.data);
        app.log("topic :" + msg.topic);
        app.log("msg   :" + msg.msg);
      } catch (e) {
        console.error("E", e);
        app.log("Message Recv Data :" + e.data);
        app.log("Error " + e);
      }
    };

    return wrap;
  };
  var wsmqtt = wsmqttfn();

  setInterval(function () {
    if (wsmqtt.isClosed()) {
      console.log("[WS] connect start");
      wsmqtt = wsmqttfn();
    }
    console.log("interval");
    wsmqtt.stat();
  }, 5000);
});
